// document.getElementById('inp1').value



function calcFee(param){
    if(param.keyCode == 13){

    	calcAll();
		//в расчетах не устранена накапливаемая погрешность от округления до 2-х зн. после запятой!

	}
}	

function calcAll(){
		var Intl=document.getElementById('inp1').value;

		document.getElementById('PP_1').innerHTML=parseFloat((Intl*0.034).toFixed(2)); 
		document.getElementById('PP_2').innerHTML=0.3;
		var Pp=Intl*0.034+0.3;
			if (from_us.checked == 1)
				{var Pp=Intl*0.019+0.3;
				document.getElementById('PP_1').innerHTML=parseFloat((Intl*0.019).toFixed(2));
				}

		var Wb=(Intl-Pp)*0.05; 
		if ( Wb >= 50 )
			{document.getElementById('westb').innerHTML=50}
		else {document.getElementById('westb').innerHTML=parseFloat(Wb.toFixed(2));} 

		//document.getElementById('westb').innerHTML=parseFloat(((A-A/100*1.9)-0.3-((A-A/100*1.9)-0.3)*0.05).toFixed(2));
		
		var eB=Intl*0.1;
		document.getElementById('e_bay').innerHTML=parseFloat( eB ).toFixed(2);
		document.getElementById('payon_1').innerHTML=5;
		var T=Intl-(Pp+Wb+eB+5);
			if (few_days.checked)
				{var T=Intl-(Pp+Wb+eB+2);
				document.getElementById('payon_1').innerHTML=2;
				}
		var	Pn=T*0.018+3.15;
		document.getElementById('payon_2').innerHTML=parseFloat(( Pn ).toFixed(2));
			if (shop.checked == 1)
				{var Pn=T*0.035;;
				document.getElementById('payon_2').innerHTML=parseFloat(( Pn ).toFixed(2));
				}		 

		document.getElementById('total_losses').innerHTML=parseFloat( (Pp+Wb+eB+Pn).toFixed(2));
		document.getElementById('ttl_losses_perc').innerHTML=parseFloat((100*(Pp+Wb+eB+Pn)/Intl).toFixed(2));
		document.getElementById('remainder').innerHTML=parseFloat( (Intl-Pp-Wb-eB-Pn ).toFixed(2));
/*			
		var data = [];
		data.push([1,	'Австралия',	18.30,	14.95,	18.30,	20.40,	1255]);
		data.push([2,	'Австрия',	24.00,	4.45,	24.85,	4.05,	2.70]);
		data.push([4,	'Албания',	22.15,	6.80,	26.70,	6.15,	2.35]);
		data.push([10,	'Аргентина',	28.30,	10.50,	28.30,	13.60,	1.65]);
		data.push([17,	'Бахрейн',	23.80,	9.85,	23.80,	10.70,	4.75]);
		data.push([18,	'Белиз',	27.85,	19.20,	27.85,	20.40,	2.70]);
		data.push([19,	'Бельгия',	31.90,	5.00,	35.00,	6.30,	3.60]);
		data.push([23,	'Болгария',	17.10,	5.45,	19.75,	5.45,	3.70]);
		data.push([24,	'Боливия',	25.95,	17.60,	33.70,	14.70,	1.65]);
		data.push([25,	'Босния и Герцеговина',	25.70,	6.20,	25.00,	7.40,	2.35]);
		data.push([27,	'Бразилия',	24.95,	9.75,	24.40,	13.40,	1.65]);
		data.push([34,	'Великобритания',	29.20,	7.35,	29.20,	8.05	1.60]);
		data.push([35,	'Венгрия',	26.80,	4.80,	26.80,	6.10,	0.55]);
		data.push([36,	'Венесуэла',	19.50,	10.40,	27.50,	11.20,	1.65]);
		data.push([38,	'Вьетнам',	15.50,	8.40,	22.80,	11.45,	1.65]);
		data.push([48,	'Германия',	31.15,	3.70,	30.95,	4.75,	2.85]);
		data.push([50,	'Гондурас',	26.00,	12.65,	26.00,	15.40,	1.65]);
		data.push([51,	'Гонконг',	25.60,	7.00,	24.00,	11.10,	5.20]);
		data.push([54,	'Греция',	19.10,	7.20,	19.10,	7.40,	4.20]);
		data.push([55,	'Грузия',	24.65,	5.80,	24.65,	6.10,	1.35]);
		data.push([56,	'Дания',	24.30,	4.45,	25.30,	4.90,	3.05]);
		data.push([64,	'Израиль',	21.15,	4.60,	21.15,	4.80,	2.00]);
		data.push([65,	'Индия',	28.80	5.90,	28.50,	9.20,	1.65]);
		data.push([66,	'Индонезия',	22.00,	7.40,	31.90,	12.00,	1.60]);
		data.push([69,	'Иран. Исламская Республика',	25.30,	9.50,	30.15,	9.70,	5.05]);
		data.push([70,	'Ирландия',	29.55,	5.05,	26.20,	8.55,	1.65]);
		data.push([71,	'Исландия',	38.40,	5.85,	32.00,	10.60,	6.05]);
		data.push([72,	'Испания', 	23.35,	6.65,	24.20,	6.55,	4.00]);
		data.push([73,	'Италия',	21.80,	3.40,	21.80,	4.60,	1.65]);
		data.push([77,	'Казахстан',	18.95,	5.15,	18.95,	10.25,	2.65]);
		data.push([81,	'Канада',	21.45,	8.00,	21.45,	13.70,	5.10]);
		data.push([83,	'Катар',	16.45,	8.50,	19.70,	8.80,	4.75]);
		data.push([85,	'Кипр',	21.35,	5.60,	22.50,	5.50,	2.70]);
		data.push([86,	'Киргизия',	15.05,	8.40,	15.05,	8.70,	5.55]);
		data.push([88,	'Китай', 	16.35,	8.30,	16.35,	11.60,	5.30]);
		data.push([89,	'Колумбия',	25.50,	12.00,	27.70,	13.65,	1.65]);
		data.push([92,	'Корея. Республика',	24.00,	7.75,	27.80,	9.05,	1.65]);
		data.push([96,	'Куба',	18.75,	10.85,	22.50,	13.10,	1.65]);
		data.push([97,	'Кувейт',	23.60,	7.50,	28.30,	7.00,	2.35]);
		data.push([100,	'Латвия',	15.70,	3.15,	15.70,	3.50,	0.55]);
		data.push([105,	'Литва',	24.20,	2.60,	26.15,	2.85,	0.65]);
		data.push([106,	'Лихтенштейн',	24.40,	5.80,	25.05,	5.85,	3.00]);
		data.push([107,	'Люксембург',	23.00,	3.85,	22.95,	5.25,	3.70]);
		data.push([112,	'Макао',	25.00,	10.10,	34.00,	11.30,	5.20]);
		data.push([113,	'Македония',	22.75,	6.65,	24.30,	6.60,	1.15]);
		data.push([115,	'Малайзия',	20.40,	5.10,	29.20,	8.70,	1.65]);
		data.push([121,	'Мексика',	22.30,	10.00,	26.80,	11.85,	1.65]);
		data.push([123,	'Молдова',	21.45,	5.80,	21.45,	6.00,	2.55]);
		data.push([133,	'Нидерланды',	23.00,	3.50,	23.10,	3.50,	1.05]);
		data.push([134,	'Никарагуа',	18.20,	15.00,	18.80,	16.30,	1.65]);
		data.push([135,	'Новая Зеландия',	27.00,	20.70,	30.20,	20.80,	12.55]);
		data.push([137,	'Норвегия',	31.95,	5.85,	31.95,	7.80,	0.55]);
		data.push([138,	'Объединенные Арабские Эмираты',	16.80,	6.75,	22.20,	6.75,	4.75]);
		data.push([139,	'Оман',	22.60,	7.80,	24.20,	8.60,	1.65]);
		data.push([140,	'Пакистан',	17.10,	9.00,	28.70,	8.60,	1.65]);
		data.push([142,	'Панама',	18.00,	10.70,	20.60,	11.70,	1.65]);
		data.push([144,	'Парагвай',	16.70,	14.30,	25.80,	18.70,	1.65]);
		data.push([145,	'Перу',	19.20,	12.00,	28.20,	14.80,	4.00]);
		data.push([147,	'Польша',	21.70,	3.20,	22.25,	3.50,	0.55]);
		data.push([148,	'Португалия',	29.85,	5.80,	29.00,	7.20,	4.05]);
		data.push([150,	'Россия',	29.85,	3.40,	29.85,	6.55,	1.00]);
		data.push([152,	'Румыния',	26.55,	6.10,	26.55,	6.80,	0.50]);
		data.push([153,	'США',	15.60,	7.80,	17.90,	13.40,	3.95]);
		data.push([157,	'Саудовская Аравия',	16.70,	7.10,	24.60,	7.15,	1.65]);
		data.push([167,	'Сербия', 	25.60,	5.15,	25.95,	5.20,	1.60]);
		data.push([168,	'Сингапур',	25.00,	7.20,	30.50,	8.30,	1.65]);
		data.push([170,	'Словакия',	20.50,	3.90,	20.50,	4.00,	0.55]);
		data.push([171,	'Словения',	23.00,	4.35,	26.10,	3.80,	1.65]);
		data.push([177,	'Таджикистан',	14.60,	9.60,	14.60,	10.05,	7.40]);
		data.push([178,	'Тайвань', 	23.90,	9.25,	23.95,	10.10,	5.20]);
		data.push([179,	'Таиланд',	19.05,	6.85,	23.10,	12.10,	1.65]);
		data.push([188,	'Тунис',	21.25,	9.35,	24.80,	9.50,	1.15]);
		data.push([189,	'Туркменистан',	14.80,	5.00,	14.80,	6.60,	2.10]);
		data.push([190,	'Турция',	20.50,	4.80,	20.50,	5.90,	2.35]);
		data.push([192,	'Узбекистан',	27.80,	9.25,	27.80,	9.60,	5.30]);
		data.push([193,	'Украина',	26.25,	3.50,	27.35,	3.25,	0.50]);
		data.push([198,	'Филиппины',	17.30,	8.30,	25.40,	9.85,	5.20]);
		data.push([199,	'Финляндия',	29.40,	4.60,	29.70,	4.70,	1.20]);
		data.push([201,	'Франция', 	26.40,	3.00,	26.15,	3.50,	1.15]);
		data.push([204,	'Хорватия',	23.80,	3.90,	23.00,	4.80,	0.50]);
		data.push([207,	'Черногория',	29.10,	4.75,	28.00,	6.60,	0.50]);
		data.push([208,	'Чешская Республика',	18.85,	2.85,	19.60,	2.85,	0.80]);
		data.push([209,	'Чили',	22.55,	21.00,	29.85,	17.65,	2.70]);
		data.push([210,	'Швейцария', 	22.45,	5.65,	23.45,	5.65,	3.00]);
		data.push([211,	'Швеция',	28.50,	6.90,	28.80,	6.90,	4.90]);
		data.push([213,	'Эквадор',	26.45,	13.80,	27.20,	15.25,	1.65]);
		data.push([216,	'Эстония',	21.15,	4.15,	21.15,	4.60,	2.40]);
		data.push([221,	'Япония',	22.10,	11.30,	22.10,	12.40,	5.30]);
*/
}

	//document.write('Sam \'looked\' uhgfjkl kjhflk dklj \u00b0C');
	
	var currentTemp = 19.5;
	const message = '${currentTemp} \u00b0C';
	document.write(currentTemp + '\u00b0C');
		

/*function readInput(e) {
    if (e.keyCode == 13) { // 13 is enter key
        // Execute code here.
        // var temp = e.value;
        // console.log(temp);
        alert(e.value);
    }


onkeydown='calc()'


}	*/	
	/*function testInp(){
		if (from_us.checked == 1){
			alert('Працуе!');
		}
	}*/
/*


function calc(e){
    if(e.keyCode == 13){
    
    // your fucking code
    
    }
}
*/